{
  "version": "1.1.0",
  "workflows": [
    {
      "id": "echo-test",
      "name": "Bilko Echo Test",
      "mode": "n8n",
      "webhookPath": "bilko-echo-test",
      "description": "Verifies end-to-end connectivity between Bilko and n8n. Sends a test payload to the n8n webhook and confirms the round-trip response is received correctly. Use this to validate that the n8n integration is properly configured and responding.",
      "instructions": "Click 'Execute' to send a test message to n8n. The workflow will echo back your message with a timestamp, confirming the connection is working.",
      "category": "system"
    },
    {
      "id": "rules-audit",
      "name": "Rules Audit",
      "mode": "local",
      "description": "Analyzes the rule framework for structural integrity, cross-references, and coverage gaps. Validates that all rules are properly formatted, have valid dependencies, and follow the partitioning scheme defined in ARCH-006.",
      "instructions": "This workflow is executed via agent reasoning. Ask the agent: 'Run a rule audit' or 'Act as Rule Architect'. The agent will analyze all rules following the AGENT-002-RULES protocol and provide a comprehensive audit report.",
      "handler": "rulesAudit",
      "category": "audit"
    },
    {
      "id": "code-audit",
      "name": "Code Audit",
      "mode": "local",
      "description": "Validates that the codebase correctly implements the rules defined in /rules/. Checks for rule violations, missing implementations, and alignment between code behavior and rule specifications.",
      "instructions": "This workflow is executed via agent reasoning. Ask the agent: 'Run a code audit' or specify which rules to audit. The agent will analyze the code following the AGENT-002-CODE protocol and report any violations or gaps.",
      "handler": "codeAudit",
      "category": "audit"
    },
    {
      "id": "european-football-daily",
      "name": "European Football Daily",
      "mode": "n8n",
      "webhookPath": "european-football-daily",
      "description": "Daily automated European football news aggregation workflow. Runs at 00:00 to search the last 24 hours of European football news, identifies the most positive/cheerful event using sentiment analysis, gathers fan opinions from Reddit, generates an infographic, and publishes a congratulatory Facebook post.",
      "instructions": "This workflow runs automatically at 00:00 daily via n8n Schedule Trigger. It searches Google News RSS for European football events, uses Gemini for sentiment analysis and content generation, fetches fan opinions from Reddit, creates an infographic with Gemini Imagen, and posts to Facebook. Manual execution can be triggered for testing. Schedule: 0 0 * * * (daily at midnight).",
      "category": "content"
    }
  ]
}
